
//Горбунова;А.В.
//Вариант 2 
//Название: Линейные алгоритмы 


#include <iostream>
#include <cmath>

int main() {  
    double a = 0.52;
    double b = -3.552;
    double c = 3.24;
    double pi = 3.14;
       
    double P = b / a;
    double g = c / a;
      std::cout << P <<std::endl << g <<std::endl;

      double alpha = acos(-g / (2 * sqrt(pow(-P / 3, 3))));
            std::cout << alpha <<std::endl;

            double x1 = 2 * sqrt(-P / 3) * cos(alpha / 3);
            std::cout << x1 <<std::endl;

            double x2 = -2 * sqrt(-P / 3) * cos((alpha + pi) / 3);
            std::cout << x2 <<std::endl;

            double x3 = -2 * sqrt(-P / 3) * cos((alpha - pi) / 3);
            std::cout << x3 <<std::endl;

            return 0;

}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
